; domain
(define (domain blocksworld)
  (:requirements :strips :typing)
  (:types block)

  (:predicates
    (ontable ?x - block)
    (on ?x - block ?y - block)
    (clear ?x - block)
    (handempty)
    (holding ?x - block)
    (moved ?x)
  )

  (:action pick
    :parameters (?x - block)
    :precondition (and (clear ?x) (ontable ?x) (handempty))
    :effect (and (holding ?x)
                 (not (ontable ?x))
                 (not (clear ?x))
                 (not (handempty)))
  )

  (:action putdown
    :parameters (?x - block)
    :precondition (and (holding ?x))
    :effect (and (ontable ?x)
                 (clear ?x)
                 (handempty)
                 (not (holding ?x))
                 (moved ?x)
    )
  )

  (:action stack
    :parameters (?x - block ?y - block)
    :precondition (and (holding ?x) (clear ?y))
    :effect (and (on ?x ?y)
                 (clear ?x)
                 (handempty)
                 (not (holding ?x))
                 (not (clear ?y)))
  )

  (:action unstack
    :parameters (?x - block ?y - block)
    :precondition (and (on ?x ?y) (clear ?x) (handempty))
    :effect (and (holding ?x)
                 (clear ?y)
                 (not (on ?x ?y))
                 (not (clear ?x))
                 (not (handempty)))
  )
)

; problem
(define (problem two_blocks_move)
        (:domain blocksworld)
        (:objects r g - block)
        (:init
                (clear g)
        (clear r)
        (handempty)
        (ontable g)
        (ontable r)
        )
        (:goal (and (moved r) (moved g)))
        )

; plan
1. (pick r)
   deleted: (ontable r) (clear r) (handempty)
   added: (holding r)
   goals met: 0 of 2
2. (putdown r)
   deleted: (holding r)
   added: (ontable r) (clear r) (handempty) (moved r)
   goals met: 1 of 2
3. (pick g)
   deleted: (ontable g) (clear g) (handempty)
   added: (holding g)
   goals met: 1 of 2
4. (putdown g)
   deleted: (holding g)
   added: (ontable g) (clear g) (handempty) (moved g)
   goals met: 2 of 2
